<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Imports" data-toc-modified-id="Imports-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Read-in" data-toc-modified-id="Read-in-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Read-in</a></span></li><li><span><a href="#Documentation" data-toc-modified-id="Documentation-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Documentation</a></span></li><li><span><a href="#PHOENIX-PARK-—-Initial-Changes:-removing-unneeded;-setting-datatypes" data-toc-modified-id="PHOENIX-PARK-—-Initial-Changes:-removing-unneeded;-setting-datatypes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>PHOENIX PARK — Initial Changes: removing unneeded; setting datatypes</a></span><ul class="toc-item"><li><span><a href="#Removing-legend-information" data-toc-modified-id="Removing-legend-information-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Removing legend information</a></span></li><li><span><a href="#Assessment-of-dataset" data-toc-modified-id="Assessment-of-dataset-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Assessment of dataset</a></span></li><li><span><a href="#Dropping-of-non-required-columns" data-toc-modified-id="Dropping-of-non-required-columns-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Dropping of non-required columns</a></span></li><li><span><a href="#Setting-of-appropriate-datatypes" data-toc-modified-id="Setting-of-appropriate-datatypes-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Setting of appropriate datatypes</a></span><ul class="toc-item"><li><span><a href="#Whitespace-anomolies-will-prevent-conversion:-removing-whitespaces" data-toc-modified-id="Whitespace-anomolies-will-prevent-conversion:-removing-whitespaces-4.4.1"><span class="toc-item-num">4.4.1&nbsp;&nbsp;</span>Whitespace anomolies will prevent conversion: removing whitespaces</a></span></li><li><span><a href="#Checking-data-ranges-for-memory-optimised-converstion-to-data-sub-types" data-toc-modified-id="Checking-data-ranges-for-memory-optimised-converstion-to-data-sub-types-4.4.2"><span class="toc-item-num">4.4.2&nbsp;&nbsp;</span>Checking data ranges for memory-optimised converstion to data sub-types</a></span></li><li><span><a href="#Set-dates-as-datetime-type" data-toc-modified-id="Set-dates-as-datetime-type-4.4.3"><span class="toc-item-num">4.4.3&nbsp;&nbsp;</span>Set dates as datetime type</a></span></li></ul></li><li><span><a href="#Retaining-only-date-range-of-interest-(period-of-bus-data)" data-toc-modified-id="Retaining-only-date-range-of-interest-(period-of-bus-data)-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Retaining only date-range of interest (period of bus data)</a></span></li></ul></li><li><span><a href="#CASEMENT—-Initial-Changes:-removing-unneeded;-setting-datatypes" data-toc-modified-id="CASEMENT—-Initial-Changes:-removing-unneeded;-setting-datatypes-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>CASEMENT— Initial Changes: removing unneeded; setting datatypes</a></span><ul class="toc-item"><li><span><a href="#Check-for-the-whitespace-issue-in-casement-dataset" data-toc-modified-id="Check-for-the-whitespace-issue-in-casement-dataset-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Check for the whitespace issue in casement dataset</a></span></li><li><span><a href="#Convert-to-float16" data-toc-modified-id="Convert-to-float16-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>Convert to float16</a></span></li><li><span><a href="#Convert-date-to-type-datetime" data-toc-modified-id="Convert-date-to-type-datetime-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>Convert date to type datetime</a></span></li><li><span><a href="#Retain-only-date-range-of-interest" data-toc-modified-id="Retain-only-date-range-of-interest-5.4"><span class="toc-item-num">5.4&nbsp;&nbsp;</span>Retain only date-range of interest</a></span></li></ul></li><li><span><a href="#AIRPORT-—-Initial-Changes:-removing-unneeded;-setting-datatypes" data-toc-modified-id="AIRPORT-—-Initial-Changes:-removing-unneeded;-setting-datatypes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>AIRPORT — Initial Changes: removing unneeded; setting datatypes</a></span><ul class="toc-item"><li><span><a href="#Check-for-the-whitespace-issue" data-toc-modified-id="Check-for-the-whitespace-issue-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Check for the whitespace issue</a></span></li><li><span><a href="#Convert-to-float16" data-toc-modified-id="Convert-to-float16-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Convert to float16</a></span></li><li><span><a href="#Convert-date-to-type-datetime" data-toc-modified-id="Convert-date-to-type-datetime-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>Convert date to type datetime</a></span></li><li><span><a href="#Retain-only-time-period-of-relevance" data-toc-modified-id="Retain-only-time-period-of-relevance-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Retain only time period of relevance</a></span></li></ul></li><li><span><a href="#Joining-3-Dataframes-into-1,-Representing-Dublin-Average" data-toc-modified-id="Joining-3-Dataframes-into-1,-Representing-Dublin-Average-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Joining 3 Dataframes into 1, Representing Dublin Average</a></span><ul class="toc-item"><li><span><a href="#Prepare-for-Join" data-toc-modified-id="Prepare-for-Join-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Prepare for Join</a></span></li><li><span><a href="#Check-indices-match" data-toc-modified-id="Check-indices-match-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Check indices match</a></span></li><li><span><a href="#Join-Tables,-into-one-representing-the-averages" data-toc-modified-id="Join-Tables,-into-one-representing-the-averages-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>Join Tables, into one representing the averages</a></span></li></ul></li><li><span><a href="#Export-Dataframe" data-toc-modified-id="Export-Dataframe-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Export Dataframe</a></span></li></ul></div>

# Imports

In [1]:
# custom notebook aspect ratio

from IPython.core.display import display, HTML
display(HTML('<style>.container {width:80% !important;}</style>'))

In [2]:
# packages

import pandas as pd
import numpy as np

In [3]:
# an assessor function

def assess_df(df):
  
    feature_types = {df[df.columns[x]].dtypes.name for x in range(len(df.columns))}
    
  	# print datatypes
  
    print("Datatypes:\n")
    print(df.dtypes)
    print('\n\n')
    
    # print number rows and cols
    print('*' * 50)
    print('ROWS, COLUMNS, NULLS\n')
    print(df.shape[0], "rows in the dataframe.")
    print(df.shape[1], "columns in the dataframe.\n")
    print(df.isnull().sum().sum(), "null values in the dataframe.")
    
    # check duplicate rows & col; print if present
    
    duplicate_rows = df.duplicated(keep=False).sum()
    duplicate_cols = df.index.T.duplicated(keep=False).sum()
    
    print(duplicate_rows, "duplicate rows")
    print(duplicate_cols, "duplicate columns")
    
    if duplicate_rows > 0 or duplicate_cols > 0:
      print(df.loc[df.duplicated()])
	
    print('\n')
    
    # check for constant columns
    
    numeric_cols = list(df.select_dtypes(include=[np.number]).columns.values)
    categorical_cols = list(df.select_dtypes('category').columns.values)
    
    standard_diffs = [df.describe().loc['std', x] for x in numeric_cols]
    
    constant_categorical_column=False
    if 'category' in feature_types:
        for column in categorical_cols:
            if df[column].describe().index.unique == 1:
                constant_categorical_column = True
            
            
    if 0 in standard_diffs:
        print("Constant numeric columns: TRUE")
    else:
        print("Constant numeric columns: FALSE")
  
    if 'category' in feature_types:    
        if constant_categorical_column == True:
            print("Constant categorical columns: TRUE")
        else:
            print("Constant categorical columns: FALSE")

            
    
    print('\n\n')

    
    # feature stats
    print('*' * 50)
    print('DESCRIPTION\n')
    print(df.describe().T)
    print('\n\n')
    print('*' * 50)

    
    # feature stats: categorical
    
    if 'category' in feature_types:
        print('CATEGORICAL DESCRIPTION\n')
        print('\n')
        print(df.select_dtypes(['category']).describe().T)
        print('\n\n')
        print('*' * 50)
    
    # print feature cardinalities
    
    print("FEATURE CARDINALITIES\n")
    column_names = list(df.columns.values)

    print('{0:45}  {1}'.format("Feature", "Distinct Values"))
    print('{0:45}  {1}'.format("-------", "--------------- \n"))

    for c in column_names:
        print('{0:45}  {1}'.format(c, str(len(df[c].unique()))))
    
    print('\n')
    print('*' * 50)
    print('MEMORY\n')
    
    
    print(df.info(memory_usage='deep'))
    print('\n')
    print(df.memory_usage(deep=True))
    print('\n')
    print('*' * 50)
    print('HEAD\n')
    print(df.head(10))
    print('\n')
    print('*' * 50)
    print('TAIL\n')
    print(df.tail(10))

# Read-in

In [4]:
# read in the phoenix park dataset
# make the column names more explicit

path_phoenix = \
'/Users/davidodwyer/Documents/studyCS/Semester_3/data/original_raw_data/weather/hly175_phoenix_park/hly175.csv'

col_names = ['date','indicator1','rain','indicator2','temp','indicator3','wetbulbtemp','dew_pointt','vapour_pressure','relative_humidity','pressure']

df_phoenix = pd.read_csv(path_phoenix, names=col_names)

/Users/davidodwyer/anaconda3/envs/analytics/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (1,3,4,5,6,7,8,9,10) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [5]:
# read in the casement dataset

path_casement = \
'/Users/davidodwyer/Documents/studyCS/Semester_3/data/original_raw_data/weather/hly3723_casement/hly3723.csv'

df_casement = pd.read_csv(path_casement, usecols=[0,2,4], skiprows=23)

In [6]:
# read in the airport dataset

path_airport = \
'/Users/davidodwyer/Documents/studyCS/Semester_3/data/original_raw_data/weather/hly532_dublin_airport/hly532.csv'

df_airport = pd.read_csv(path_airport, usecols=[0,2,4], skiprows=23)

# Documentation

In [7]:
# #from csv


# Station Name: PHOENIX PARK
# Station Height: 48 M 
# Latitude:53.364  ,Longitude: -6.350


# date:  -  Date and Time (utc)

# rain:  -  Precipitation Amount (mm)	  

# temp:  -  Air Temperature (C)	

# wetb:  -  Wet Bulb Temperature (C)

# dewpt: -  Dew Point Temperature (C)

# vappr: -  Vapour Pressure (hPa)		

# rhum:  -  Relative Humidity (%) 

# msl:   -  Mean Sea Level Pressure (hPa)

# ind:   -  Indicator

# PHOENIX PARK — Initial Changes: removing unneeded; setting datatypes

## Removing legend information

In [8]:
df_phoenix.head(15)

,date,indicator1,rain,indicator2,temp,indicator3,wetbulbtemp,dew_pointt,vapour_pressure,relative_humidity,pressure
0,Station Name: PHOENIX PARK,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Station Height: 48 M,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Latitude:53.364,Longitude: -6.350,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,date: - Date and Time (utc),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,rain: - Precipitation Amount (mm)\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,temp: - Air Temperature (C)\t,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,wetb: - Wet Bulb Temperature (C),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,dewpt: - Dew Point Temperature (C),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,vappr: - Vapour Pressure (hPa)\t\t ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,rhum: - Relative Humidity (%),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,msl: - Mean Sea Level Pressure (hPa),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,ind: - Indicator,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,date,ind,rain,ind,temp,ind,wetb,dewpt,vappr,rhum,msl
13,01-may-2005 01:00,0,0.0,0,9.1,0,8.8,8.5,11.1,96,1005.7
14,01-may-2005 02:00,0,0.1,0,9.6,0,9.3,9.0,11.5,95,1004.8

In [9]:
# remove top, legend rows

df_phoenix.drop(df_phoenix.index[0:13], inplace=True)

In [10]:
df_phoenix.reset_index(drop=True, inplace=True)

In [11]:
df_phoenix.head(2)

,date,indicator1,rain,indicator2,temp,indicator3,wetbulbtemp,dew_pointt,vapour_pressure,relative_humidity,pressure
0,01-may-2005 01:00,0,0.0,0,9.1,0,8.8,8.5,11.1,96,1005.7
1,01-may-2005 02:00,0,0.1,0,9.6,0,9.3,9.0,11.5,95,1004.8

In [12]:
df_phoenix.tail(2)

,date,indicator1,rain,indicator2,temp,indicator3,wetbulbtemp,dew_pointt,vapour_pressure,relative_humidity,pressure
111358,31-may-2019 23:00,0,0.0,0,9.8,0,9.2,8.6,11.2,92,1019.6
111359,01-jun-2019 00:00,0,0.0,0,8.9,0,8.4,7.9,10.6,93,1019.5

## Assessment of dataset

In [13]:
# apply custom assessment function for dataset characteristics

assess_df(df_phoenix)

Datatypes:

date                 object
indicator1           object
rain                 object
indicator2           object
temp                 object
indicator3           object
wetbulbtemp          object
dew_pointt           object
vapour_pressure      object
relative_humidity    object
pressure             object
dtype: object



**************************************************
ROWS, COLUMNS, NULLS

111360 rows in the dataframe.
11 columns in the dataframe.

0 null values in the dataframe.
0 duplicate rows
0 duplicate columns


Constant numeric columns: FALSE



**************************************************
DESCRIPTION

                    count  unique                top   freq
date               111360  111360  29-may-2012 17:00      1
indicator1         111360       4                  0  65296
rain               111360     101                0.0  96230
indicator2         111360       3                  0  65280
temp               111360     686               12.1    527
indicator3         111360       3                  0  64978
wetbulbtemp        111360     570               10.4    592
dew_pointt         111360     576                       545
vapour_pressure    111360     382                8.3    854
relative_humidity  111360     153                 94   2502
pressure           111360    1547             1017.3    253



**************************************************
FEATURE CARDINALITIES

Feature                                        Distinct Values
-------                                        ---------------

date                                           111360
indicator1                                     4
rain                                           101
indicator2                                     3
temp                                           686
indicator3                                     3
wetbulbtemp                                    570
dew_pointt                                     576
vapour_pressure                                382
relative_humidity                              153
pressure                                       1547


**************************************************
MEMORY

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111360 entries, 0 to 111359
Data columns (total 11 columns):
date                 111360 non-null object
indicator1           111360 non-null object
rain                 111360 non-null object
indicator2           111360 non-null object
temp                 111360 non-null object
indicator3           111360 non-null object
wetbulbtemp          111360 non-null object
dew_pointt           111360 non-null object
vapour_pressure      111360 non-null object
relative_humidity    111360 non-null object
pressure             111360 non-null object
dtypes: object(11)
memory usage: 62.1 MB
None


Index                     80
date                 8240640
indicator1           5789737
rain                 6681144
indicator2           5791302
temp                 5431482
indicator3           5791302
wetbulbtemp          5424566
dew_pointt           5419972
vapour_pressure      5428263
relative_humidity    5516553
pressure             5583329
dtype: int64


**************************************************
HEAD

                date indicator1 rain indicator2  temp indicator3 wetbulbtemp  \
0  01-may-2005 01:00          0  0.0          0   9.1          0         8.8
1  01-may-2005 02:00          0  0.1          0   9.6          0         9.3
2  01-may-2005 03:00          0  0.0          0  10.0          0         9.7
3  01-may-2005 04:00          0  0.0          0  10.1          0         9.8
4  01-may-2005 05:00          0  0.0          0  10.2          0         9.8
5  01-may-2005 06:00          0  0.0          0  10.6          0        10.1
6  01-may-2005 07:00          0  0.0          0  10.8          0        10.3
7  01-may-2005 08:00          0  0.1          0  12.2          0        11.0
8  01-may-2005 09:00          0  0.0          0  13.4          0        11.3
9  01-may-2005 10:00          0  0.0          0  16.0          0        13.3

  dew_pointt vapour_pressure relative_humidity pressure
0        8.5            11.1                96   1005.7
1        9.0            11.5                95   1004.8
2        9.3            11.7                95   1003.5
3        9.4            11.8                95   1002.8
4        9.4            11.8                94   1002.2
5        9.5            11.9                93   1001.4
6        9.9            12.2                93   1002.0
7        9.8            12.1                85   1001.5
8        9.4            11.8                76   1002.0
9       10.9            13.1                71   1001.6


**************************************************
TAIL

                     date indicator1 rain indicator2  temp indicator3  \
111350  31-may-2019 15:00          0  0.0          0  19.2          0
111351  31-may-2019 16:00          0  0.0          0  17.1          0
111352  31-may-2019 17:00          0  0.0          0  16.8          0
111353  31-may-2019 18:00          0  0.0          0  16.3          0
111354  31-may-2019 19:00          0  0.1          0  14.8          0
111355  31-may-2019 20:00          0  0.0          0  13.8          0
111356  31-may-2019 21:00          0  0.0          0  12.4          0
111357  31-may-2019 22:00          0  0.0          0  11.1          0
111358  31-may-2019 23:00          0  0.0          0   9.8          0
111359  01-jun-2019 00:00          0  0.0          0   8.9          0

       wetbulbtemp dew_pointt vapour_pressure relative_humidity pressure
111350        15.2       12.1            14.1                63   1016.2
111351        14.2       11.9            13.9                71   1016.2
111352        14.2       12.1            14.1                74   1016.3
111353        14.2       12.6            14.6                78   1016.6
111354          13       11.4            13.5                79   1017.3
111355          12       10.3            12.5                79   1017.8
111356        11.1        9.9            12.2                84   1018.8
111357        10.3        9.5            11.9                90   1019.3
111358         9.2        8.6            11.2                92   1019.6
111359         8.4        7.9            10.6                93   1019.5

## Dropping of non-required columns

The below columns shall be dropped. 

<br>

Wet Bulb Temp, Dew Point, Vapour Pressure, and Pressure do not influence persons taking the bus. 

<br>

Indicator columns contain no useful information; meaning unclear in addition.

<br>

While humidity might influence persons behaviour, humidity is relative constant year-round in Dublin:

<br>

https://weather-and-climate.com/average-monthly-Humidity-perc,Dublin,Ireland

In [14]:
# drop unneeded / uninformative columns

df_phoenix.drop(['indicator1',
                'indicator2', 
                'indicator3',
                'wetbulbtemp',
                'dew_pointt',
                'vapour_pressure',
                'relative_humidity',
                'pressure'], axis=1, inplace=True
               )

## Setting of appropriate datatypes

### Whitespace anomolies will prevent conversion: removing whitespaces

In [15]:
df_phoenix.dtypes

date    object
rain    object
temp    object
dtype: object

In [16]:
# check single whitespace strings in temperature column

len(df_phoenix.loc[df_phoenix.temp == ' ', 'temp'])

243

In [17]:
# check single whitespace strings in rainfall column

len(df_phoenix.loc[df_phoenix.rain == ' ', 'temp'])

233

In [18]:
# temperature
# replace single whitespace cells with NaN value
df_phoenix.temp.replace(' ', np.nan, inplace=True)

# remove any leading / trailing whitespace, as precaution
df_phoenix.temp = df_phoenix.temp.str.strip()

In [19]:
# repeat the same procedure for rainfall

df_phoenix.rain.replace(' ', np.nan, inplace=True)

df_phoenix.rain = df_phoenix.rain.str.strip()

In [20]:
# check for successful conversion to NaN: temperature

len(df_phoenix.loc[df_phoenix.rain == ' ', 'temp'])

0

In [21]:
# check for successful conversion to NaN: rainfall

len(df_phoenix.loc[df_phoenix.rain == ' ', 'rain'])

0

### Checking data ranges for memory-optimised converstion to data sub-types

In [22]:
# convert to a numeric type to allow for comparison operators

df_phoenix = df_phoenix.astype({
    'rain':'float',
    'temp':'float'
})

In [23]:
# find the max rain value

df_phoenix.rain.value_counts().index.max()

23.9

In [24]:
# find the min rain value

df_phoenix.rain.value_counts().index.min()

0.0

In [25]:
# find the max temp value

df_phoenix.temp.value_counts().index.max()

27.1

In [26]:
# find the min temp value

df_phoenix.temp.value_counts().index.min()

-10.4

In [27]:
# a float16 sub-data types is sufficient to cover these ranges
# convert to float16

df_phoenix = df_phoenix.astype({
    'rain':'float16',
    'temp':'float16'
})

### Set dates as datetime type

In [28]:
df_phoenix['date'] = pd.to_datetime(df_phoenix.date, dayfirst=True)

In [29]:
df_phoenix.head()

                 date      rain       temp
0 2005-05-01 01:00:00  0.000000   9.101562
1 2005-05-01 02:00:00  0.099976   9.601562
2 2005-05-01 03:00:00  0.000000  10.000000
3 2005-05-01 04:00:00  0.000000  10.101562
4 2005-05-01 05:00:00  0.000000  10.203125

## Retaining only date-range of interest (period of bus data)

In [30]:
start_timestamp = pd.to_datetime('1/1/2018', dayfirst=True)

In [31]:
start_timestamp

Timestamp('2018-01-01 00:00:00')

In [32]:
end_timestamp = pd.to_datetime('31/12/2018', dayfirst=True)

In [33]:
end_timestamp

Timestamp('2018-12-31 00:00:00')

In [34]:
df_phoenix = df_phoenix.loc[(df_phoenix.date >= start_timestamp) &\
                           (df_phoenix.date <= end_timestamp)]

In [35]:
df_phoenix.head(5)

                     date      rain  temp
98975 2018-01-01 00:00:00  0.000000   NaN
98976 2018-01-01 01:00:00  0.099976   NaN
98977 2018-01-01 02:00:00  0.000000   NaN
98978 2018-01-01 03:00:00  0.000000   NaN
98979 2018-01-01 04:00:00  0.000000   NaN

In [36]:
df_phoenix.reset_index(drop=True, inplace=True)

In [37]:
df_phoenix.head()

                 date      rain  temp
0 2018-01-01 00:00:00  0.000000   NaN
1 2018-01-01 01:00:00  0.099976   NaN
2 2018-01-01 02:00:00  0.000000   NaN
3 2018-01-01 03:00:00  0.000000   NaN
4 2018-01-01 04:00:00  0.000000   NaN

# CASEMENT— Initial Changes: removing unneeded; setting datatypes

In [38]:
df_casement.head()

                date  rain  temp
0  01-jan-1989 00:00   0.0   7.2
1  01-jan-1989 01:00   0.0   7.4
2  01-jan-1989 02:00   0.0   7.3
3  01-jan-1989 03:00   0.0   7.2
4  01-jan-1989 04:00   0.0   7.3

In [39]:
assess_df(df_casement)

Datatypes:

date     object
rain    float64
temp    float64
dtype: object



**************************************************
ROWS, COLUMNS, NULLS

266593 rows in the dataframe.
3 columns in the dataframe.

0 null values in the dataframe.
0 duplicate rows
0 duplicate columns


Constant numeric columns: FALSE



**************************************************
DESCRIPTION

         count      mean       std   min  25%  50%   75%   max
rain  266593.0  0.087044  0.424337   0.0  0.0  0.0   0.0  19.7
temp  266593.0  9.821057  5.071768 -15.4  6.3  9.9  13.4  30.3



**************************************************
FEATURE CARDINALITIES

Feature                                        Distinct Values
-------                                        ---------------

date                                           266593
rain                                           118
temp                                           402


**************************************************
MEMORY

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 266593 entries, 0 to 266592
Data columns (total 3 columns):
date    266593 non-null object
rain    266593 non-null float64
temp    266593 non-null float64
dtypes: float64(2), object(1)
memory usage: 22.9 MB
None


Index          80
date     19727882
rain      2132744
temp      2132744
dtype: int64


**************************************************
HEAD

                date  rain  temp
0  01-jan-1989 00:00   0.0   7.2
1  01-jan-1989 01:00   0.0   7.4
2  01-jan-1989 02:00   0.0   7.3
3  01-jan-1989 03:00   0.0   7.2
4  01-jan-1989 04:00   0.0   7.3
5  01-jan-1989 05:00   0.0   7.3
6  01-jan-1989 06:00   0.0   6.6
7  01-jan-1989 07:00   0.0   7.1
8  01-jan-1989 08:00   0.0   7.5
9  01-jan-1989 09:00   0.0   7.4


**************************************************
TAIL

                     date  rain  temp
266583  31-may-2019 15:00   0.0  16.9
266584  31-may-2019 16:00   0.0  17.1
266585  31-may-2019 17:00   0.0  15.9
266586  31-may-2019 18:00   0.0  15.7
266587  31-may-2019 19:00   0.1  14.8
266588  31-may-2019 20:00   0.0  13.7
266589  31-may-2019 21:00   0.0  12.3
266590  31-may-2019 22:00   0.0  10.1
266591  31-may-2019 23:00   0.0  10.8
266592  01-jun-2019 00:00   0.0   9.5

Note: Casement dataset has temperature data

## Check for the whitespace issue in casement dataset

In [40]:
# check single whitespace strings in temperature column

len(df_casement.loc[df_casement.temp == ' ', 'temp'])

/Users/davidodwyer/anaconda3/envs/analytics/lib/python3.7/site-packages/pandas/core/ops.py:1649: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  result = method(y)

0

In [41]:
# check single whitespace strings in rainfall column

len(df_casement.loc[df_casement.rain == ' ', 'rain'])

0

## Convert to float16

In [42]:
df_casement = df_casement.astype({
    'rain':'float16',
    'temp':'float16'
})

## Convert date to type datetime

In [43]:
df_casement['date'] = pd.to_datetime(df_casement.date, dayfirst=True)

## Retain only date-range of interest

In [44]:
df_casement = df_casement.loc[(df_casement.date >= start_timestamp) &\
                           (df_casement.date <= end_timestamp)]

In [45]:
df_casement.head()

                      date      rain      temp
254208 2018-01-01 00:00:00  0.099976  4.000000
254209 2018-01-01 01:00:00  0.000000  4.300781
254210 2018-01-01 02:00:00  0.000000  4.300781
254211 2018-01-01 03:00:00  0.000000  4.699219
254212 2018-01-01 04:00:00  0.000000  4.800781

In [46]:
df_casement.reset_index(drop=True, inplace=True)

In [47]:
df_casement.head()

                 date      rain      temp
0 2018-01-01 00:00:00  0.099976  4.000000
1 2018-01-01 01:00:00  0.000000  4.300781
2 2018-01-01 02:00:00  0.000000  4.300781
3 2018-01-01 03:00:00  0.000000  4.699219
4 2018-01-01 04:00:00  0.000000  4.800781

# AIRPORT — Initial Changes: removing unneeded; setting datatypes

In [48]:
df_airport.head()

                date  rain  temp
0  01-jan-1989 00:00   0.0   6.8
1  01-jan-1989 01:00   0.0   7.9
2  01-jan-1989 02:00   0.0   7.9
3  01-jan-1989 03:00   0.0   7.2
4  01-jan-1989 04:00   0.0   6.2

In [49]:
assess_df(df_airport)

Datatypes:

date     object
rain    float64
temp    float64
dtype: object



**************************************************
ROWS, COLUMNS, NULLS

266593 rows in the dataframe.
3 columns in the dataframe.

0 null values in the dataframe.
0 duplicate rows
0 duplicate columns


Constant numeric columns: FALSE



**************************************************
DESCRIPTION

         count      mean       std   min  25%  50%   75%   max
rain  266593.0  0.086558  0.417530   0.0  0.0  0.0   0.0  26.5
temp  266593.0  9.778262  4.940449 -11.5  6.3  9.8  13.3  28.5



**************************************************
FEATURE CARDINALITIES

Feature                                        Distinct Values
-------                                        ---------------

date                                           266593
rain                                           117
temp                                           372


**************************************************
MEMORY

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 266593 entries, 0 to 266592
Data columns (total 3 columns):
date    266593 non-null object
rain    266593 non-null float64
temp    266593 non-null float64
dtypes: float64(2), object(1)
memory usage: 22.9 MB
None


Index          80
date     19727882
rain      2132744
temp      2132744
dtype: int64


**************************************************
HEAD

                date  rain  temp
0  01-jan-1989 00:00   0.0   6.8
1  01-jan-1989 01:00   0.0   7.9
2  01-jan-1989 02:00   0.0   7.9
3  01-jan-1989 03:00   0.0   7.2
4  01-jan-1989 04:00   0.0   6.2
5  01-jan-1989 05:00   0.0   6.0
6  01-jan-1989 06:00   0.0   5.4
7  01-jan-1989 07:00   0.0   6.2
8  01-jan-1989 08:00   0.0   5.4
9  01-jan-1989 09:00   0.0   5.7


**************************************************
TAIL

                     date  rain  temp
266583  31-may-2019 15:00   0.0  16.8
266584  31-may-2019 16:00   0.0  16.8
266585  31-may-2019 17:00   0.0  15.9
266586  31-may-2019 18:00   0.1  15.0
266587  31-may-2019 19:00   0.0  14.5
266588  31-may-2019 20:00   0.0  13.7
266589  31-may-2019 21:00   0.0  12.3
266590  31-may-2019 22:00   0.0  11.9
266591  31-may-2019 23:00   0.0  10.9
266592  01-jun-2019 00:00   0.0  10.7

Note: airport also has temperatures

## Check for the whitespace issue

In [50]:
# check single whitespace strings in temperature column

len(df_airport.loc[df_airport.temp == ' ', 'temp'])

0

In [51]:
# check single whitespace strings in rainfall column

len(df_airport.loc[df_airport.rain == ' ', 'rain'])

0

## Convert to float16

In [52]:
df_airport = df_airport.astype({
    'rain':'float16',
    'temp':'float16'
})

## Convert date to type datetime

In [53]:
df_airport['date'] = pd.to_datetime(df_airport.date, dayfirst=True)

## Retain only time period of relevance

In [54]:
df_airport = df_airport.loc[(df_airport.date >= start_timestamp) &\
                           (df_airport.date <= end_timestamp)]

In [55]:
# reset index

df_airport.reset_index(drop=True, inplace=True)

In [56]:
df_airport.head()

                 date  rain      temp
0 2018-01-01 00:00:00   0.0  4.500000
1 2018-01-01 01:00:00   0.0  4.398438
2 2018-01-01 02:00:00   0.0  4.601562
3 2018-01-01 03:00:00   0.0  4.601562
4 2018-01-01 04:00:00   0.0  5.101562

In [57]:
assess_df(df_airport)

Datatypes:

date    datetime64[ns]
rain           float16
temp           float16
dtype: object



**************************************************
ROWS, COLUMNS, NULLS

8737 rows in the dataframe.
3 columns in the dataframe.

0 null values in the dataframe.
0 duplicate rows
0 duplicate columns


Constant numeric columns: FALSE



**************************************************
DESCRIPTION

       count      mean       std       min  25%       50%        75%  \
rain  8737.0  0.079651  0.362305  0.000000  0.0  0.000000   0.000000
temp  8737.0       inf  5.511719 -4.800781  6.0  9.601562  13.898438

            max
rain   7.699219
temp  26.296875



**************************************************
FEATURE CARDINALITIES

Feature                                        Distinct Values
-------                                        ---------------

date                                           8737
rain                                           46
temp                                           300


**************************************************
MEMORY

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8737 entries, 0 to 8736
Data columns (total 3 columns):
date    8737 non-null datetime64[ns]
rain    8737 non-null float16
temp    8737 non-null float16
dtypes: datetime64[ns](1), float16(2)
memory usage: 102.5 KB
None


Index       80
date     69896
rain     17474
temp     17474
dtype: int64


**************************************************
HEAD

                 date  rain      temp
0 2018-01-01 00:00:00   0.0  4.500000
1 2018-01-01 01:00:00   0.0  4.398438
2 2018-01-01 02:00:00   0.0  4.601562
3 2018-01-01 03:00:00   0.0  4.601562
4 2018-01-01 04:00:00   0.0  5.101562
5 2018-01-01 05:00:00   0.0  5.000000
6 2018-01-01 06:00:00   0.0  4.800781
7 2018-01-01 07:00:00   0.0  4.300781
8 2018-01-01 08:00:00   0.0  4.000000
9 2018-01-01 09:00:00   0.0  4.601562


**************************************************
TAIL

                    date      rain       temp
8727 2018-12-30 15:00:00  0.000000  11.000000
8728 2018-12-30 16:00:00  0.000000  10.296875
8729 2018-12-30 17:00:00  0.000000  10.000000
8730 2018-12-30 18:00:00  0.000000  10.101562
8731 2018-12-30 19:00:00  0.000000  10.101562
8732 2018-12-30 20:00:00  0.000000   9.601562
8733 2018-12-30 21:00:00  0.000000   9.898438
8734 2018-12-30 22:00:00  0.000000  10.000000
8735 2018-12-30 23:00:00  0.000000   9.296875
8736 2018-12-31 00:00:00  0.099976   9.296875

# Joining 3 Dataframes into 1, Representing Dublin Average

## Prepare for Join

Note: Since Phoenix Park does not have temperature information, we will give it the temperature data of another station. This is for ease of joining the tables into an average for each column & row.

In [58]:
df_phoenix.temp.value_counts()

Series([], Name: temp, dtype: int64)

In [59]:
df_phoenix.temp.head()

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: temp, dtype: float16

In [60]:
df_phoenix.temp = df_casement.temp

In [61]:
df_phoenix.head()

                 date      rain      temp
0 2018-01-01 00:00:00  0.000000  4.000000
1 2018-01-01 01:00:00  0.099976  4.300781
2 2018-01-01 02:00:00  0.000000  4.300781
3 2018-01-01 03:00:00  0.000000  4.699219
4 2018-01-01 04:00:00  0.000000  4.800781

## Check indices match

In [62]:
print(df_phoenix.head(2))
print(df_casement.head(2))
print(df_airport.head(2))

                 date      rain      temp
0 2018-01-01 00:00:00  0.000000  4.000000
1 2018-01-01 01:00:00  0.099976  4.300781
                 date      rain      temp
0 2018-01-01 00:00:00  0.099976  4.000000
1 2018-01-01 01:00:00  0.000000  4.300781
                 date  rain      temp
0 2018-01-01 00:00:00   0.0  4.500000
1 2018-01-01 01:00:00   0.0  4.398438

In [63]:
print(df_phoenix.dtypes)
print(df_casement.dtypes)
print(df_airport.dtypes)

date    datetime64[ns]
rain           float16
temp           float16
dtype: object
date    datetime64[ns]
rain           float16
temp           float16
dtype: object
date    datetime64[ns]
rain           float16
temp           float16
dtype: object

## Join Tables, into one representing the averages

In [64]:
weather = pd.concat([df_phoenix, df_casement, df_airport])\
.groupby('date').mean()

In [65]:
weather.head()

                         rain      temp
date
2018-01-01 00:00:00  0.033325  4.167969
2018-01-01 01:00:00  0.033325  4.332031
2018-01-01 02:00:00  0.000000  4.402344
2018-01-01 03:00:00  0.000000  4.667969
2018-01-01 04:00:00  0.000000  4.902344

In [66]:
weather.reset_index(inplace=True)

In [67]:
weather.head()

                 date      rain      temp
0 2018-01-01 00:00:00  0.033325  4.167969
1 2018-01-01 01:00:00  0.033325  4.332031
2 2018-01-01 02:00:00  0.000000  4.402344
3 2018-01-01 03:00:00  0.000000  4.667969
4 2018-01-01 04:00:00  0.000000  4.902344

In [68]:
assess_df(weather)

Datatypes:

date    datetime64[ns]
rain           float16
temp           float16
dtype: object



**************************************************
ROWS, COLUMNS, NULLS

8737 rows in the dataframe.
3 columns in the dataframe.

0 null values in the dataframe.
0 duplicate rows
0 duplicate columns


Constant numeric columns: FALSE



**************************************************
DESCRIPTION

       count      mean       std       min       25%       50%      75%  \
rain  8737.0  0.077759  0.313477  0.000000  0.000000  0.000000   0.0000
temp  8737.0       inf  5.582031 -4.867188  6.066406  9.734375  14.0625

            max
rain   6.066406
temp  26.968750



**************************************************
FEATURE CARDINALITIES

Feature                                        Distinct Values
-------                                        ---------------

date                                           8737
rain                                           130
temp                                           1215


**************************************************
MEMORY

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8737 entries, 0 to 8736
Data columns (total 3 columns):
date    8737 non-null datetime64[ns]
rain    8737 non-null float16
temp    8737 non-null float16
dtypes: datetime64[ns](1), float16(2)
memory usage: 102.5 KB
None


Index       80
date     69896
rain     17474
temp     17474
dtype: int64


**************************************************
HEAD

                 date      rain      temp
0 2018-01-01 00:00:00  0.033325  4.167969
1 2018-01-01 01:00:00  0.033325  4.332031
2 2018-01-01 02:00:00  0.000000  4.402344
3 2018-01-01 03:00:00  0.000000  4.667969
4 2018-01-01 04:00:00  0.000000  4.902344
5 2018-01-01 05:00:00  0.000000  4.800781
6 2018-01-01 06:00:00  0.000000  4.531250
7 2018-01-01 07:00:00  0.000000  4.167969
8 2018-01-01 08:00:00  0.000000  3.933594
9 2018-01-01 09:00:00  0.000000  4.402344


**************************************************
TAIL

                    date      rain       temp
8727 2018-12-30 15:00:00  0.000000  10.804688
8728 2018-12-30 16:00:00  0.000000  10.164062
8729 2018-12-30 17:00:00  0.000000   9.929688
8730 2018-12-30 18:00:00  0.000000   9.765625
8731 2018-12-30 19:00:00  0.000000   9.765625
8732 2018-12-30 20:00:00  0.000000   9.734375
8733 2018-12-30 21:00:00  0.000000   9.898438
8734 2018-12-30 22:00:00  0.000000   9.734375
8735 2018-12-30 23:00:00  0.000000   9.367188
8736 2018-12-31 00:00:00  0.033325   8.960938

In [69]:
len(weather.loc[weather.temp == np.inf])

0

Note, we've an infinite value for mean of temp, likely due to the float16 precision. Will not be a problem

In [70]:
weather.shape

(8737, 3)

In [71]:
weather.dtypes

date    datetime64[ns]
rain           float16
temp           float16
dtype: object

In [72]:
weather = weather.astype({
    'rain':'float32',
    'temp':'float32'
})

# Export Dataframe

In [73]:
weather.to_feather('/Users/davidodwyer/Documents/studyCS/Semester_3/data/dataframes/L145/weather.feather')